In [2]:
import pandas as pd

In [5]:
myseries = pd.Series(range(0,4))
myseries

0    0
1    1
2    2
3    3
dtype: int64

In [6]:
sdata = {'서울':3000, '부산':200}
myseries = pd.Series(sdata) # {index(key) value}
myseries

서울    3000
부산     200
dtype: int64

In [24]:
import numpy as np

nparray1 = np.array([[1,2,3],[4,5,6]])
display(pd.DataFrame(nparray1))

nparray2 = [[7,8,9],[10,11,12]]
display(pd.DataFrame(nparray2))

dictionary1 = { 'a' : [1,4] , 'b' : [2,5] , 'c' : [3,6]}
display(pd.DataFrame(dictionary1))

   0  1  2
0  1  2  3
1  4  5  6

    0   1   2
0   7   8   9
1  10  11  12

   a  b  c
0  1  2  3
1  4  5  6

In [1]:
import pandas as pd

daeshin = {'open' : [11650,11100,11200,11100,11000], 
           'high' : [12100,11800,11200,11100,11150],
           'low' : [11600,11050,10900,10950,10900],
           'close' : [11900,11600,11000,11100,11050]}

daeshin_day = pd.DataFrame(daeshin)
#display(daeshin_day)
print(daeshin_day)

    open   high    low  close
0  11650  12100  11600  11900
1  11100  11800  11050  11600
2  11200  11200  10900  11000
3  11100  11100  10950  11100
4  11000  11150  10900  11050

In [4]:
date = ['16.02.25','16.02.26','16.02.27','16.02.28','16.02.29']
daeshin_day = pd.DataFrame(daeshin_day, index=date)
print(daeshin_day)

          open  high  low  close
16.02.25   NaN   NaN  NaN    NaN
16.02.26   NaN   NaN  NaN    NaN
16.02.27   NaN   NaN  NaN    NaN
16.02.28   NaN   NaN  NaN    NaN
16.02.29   NaN   NaN  NaN    NaN

In [65]:
import numpy as np
import pandas as pd

df = pd.DataFrame(np.arange(1,10).reshape([3,3]), columns = ['A','B','C'])

In [66]:
display(df)
display(df['A']) # 칼럼선택
display(df[['A','B']]) # 다중컬럼 선택
display(df['B'][0:2]) # dataframe[특정열][특정행]

display(df.loc[0]) # 행 선택 loc 중요!
display(df.loc[0:2]['B']) # dataframe.loc[특정행][특정열]

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

0    1
1    4
2    7
Name: A, dtype: int32

   A  B
0  1  2
1  4  5
2  7  8

0    2
1    5
Name: B, dtype: int32

A    1
B    2
C    3
Name: 0, dtype: int32

0    2
1    5
2    8
Name: B, dtype: int32

In [6]:
import pandas as pd
print(pd.__version__)

2.2.2

In [67]:
df.loc[3] = [10,11,12] # 행추가, iloc는 안됨!
display(df)

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [68]:
df2 = pd.DataFrame([[13,14,15]])
display(df2)
display(df)
df3 = pd.DataFrame([[13,14,15]], columns=['A','B','C'])

    0   1   2
0  13  14  15

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [69]:

df1 = pd.concat([df,df2],axis=0,ignore_index=True)
display(df1)

df1_1 = pd.concat([df,df3],axis=0,ignore_index=True)
display(df1_1)

      A     B     C     0     1     2
0   1.0   2.0   3.0   NaN   NaN   NaN
1   4.0   5.0   6.0   NaN   NaN   NaN
2   7.0   8.0   9.0   NaN   NaN   NaN
3  10.0  11.0  12.0   NaN   NaN   NaN
4   NaN   NaN   NaN  13.0  14.0  15.0

    A   B   C
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

In [70]:
df.columns = list('abc') # 칼럼명 변경
df

    a   b   c
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12

In [71]:
df['d'] = list('dddd')
df

    a   b   c  d
0   1   2   3  d
1   4   5   6  d
2   7   8   9  d
3  10  11  12  d

In [39]:
df['e'] = ['e','e','e','e']
df

    a   b   c  d  e
0   1   2   3  d  e
1   4   5   6  d  e
2   7   8   9  d  e
3  10  11  12  d  e

In [73]:
df['7'] = [7]*4
df

    a   b   c  d  7
0   1   2   3  d  7
1   4   5   6  d  7
2   7   8   9  d  7
3  10  11  12  d  7

In [74]:
df = df.drop('7', axis=1)
display(df)

    a   b   c  d
0   1   2   3  d
1   4   5   6  d
2   7   8   9  d
3  10  11  12  d

In [76]:
df = df.drop(['c','d'], axis=1)

In [77]:
df = df.drop(2,axis=0)
display(df)

    a   b
0   1   2
1   4   5
3  10  11

In [78]:
df = df.drop([0,3],axis=0)
display(df)

   a  b
1  4  5

In [80]:
df.loc[0] = [1,2] # 명칭기반이므로 기존 dataframe의 마지막행 밑에 0이라는 인텍스명을 가진 행을 추가하는것
display(df)

   a  b
1  4  5
0  1  2

In [81]:
df.loc[2] = [11,12]
display(df)

    a   b
1   4   5
0   1   2
2  11  12

In [82]:
df.iloc[3] = [17,19] # 에러. 안됨XXXXXX

IndexError: iloc cannot enlarge its target object

In [84]:
df.loc[0][0] = 200
display(df)

C:\Users\UserK\AppData\Local\Temp\ipykernel_2536\1438870324.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.loc[0]['a'] = 200

     a   b
1    4   5
0  200   2
2   11  12

In [86]:
df.iloc[0]['a'] = 200
display(df)

C:\Users\UserK\AppData\Local\Temp\ipykernel_2536\1431225473.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df.iloc[0]['a'] = 200

     a   b
1  200   5
0  200   2
2   11  12

In [60]:
df = pd.read_csv("data.csv"); display(df)

   number  height  weight
0      32     179      81
1       1     181      46
2      23     154      67
3       4     167      54
4       5     181      81
5      67     143      47
6       3     171      69
7      23     178      89
8      89     148      51
9      61     157      62

In [62]:
df.loc[10] = [23,165,56]
df.to_csv("data.csv") # 덮어쓰기도 가능
df.to_csv("data2.csv")

In [1]:
import pandas as pdi
import ydata_profiling as ydp

df = pd.read_csv("Heart.csv")

report = ydp.ProfileReport(df)

report.to_file("report.html")

ModuleNotFoundError: No module named 'pkg_resources'

In [2]:
import os
os.getcwd()

'c:\\Users\\UserK\\Desktop\\Ranee\\SW_CAMP\\파이썬을 활용한 기초 프로그래밍'

In [10]:
import pandas as pd
data = {
    'food': ['KFC', 'McDonald', 'SchoolFood'], 
    'price': [1000, 2000, 2500], 
    'rating': [4.5, 3.9, 4.2]
}

df = pd.DataFrame(data)
df

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [5]:
df[['food','rating']]

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [11]:
df1 = df.rename(columns={'food':'place'}, inplace=False)
display(df1)
display(df)

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

         food  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2

In [12]:
df1 = df.rename(columns={'food':'place'}, inplace=True)
display(df1)
display(df)

None

        place  price  rating
0         KFC   1000     4.5
1    McDonald   2000     3.9
2  SchoolFood   2500     4.2